index.html
<!DOCTYPE html><html><head><!--  --><meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Homepage</title>
<meta name="generator" content="Org Mode" />
<link href="https://fonts.cdnfonts.com/css/share-tech-mono" rel="stylesheet"><link rel="stylesheet" type="text/css" href="/assets/code.css"/><link rel="stylesheet" type="text/css" href="/assets/style.css"/>
</head><body><header><div class="container"><h1>Gold Ayan's Tinker Garage</h1></div><div class="header-content"><nav class="container"><ul class="topnav"><li><a href="/index.html">Home</a></li><li><a href="/projects.html">Projects</a></li><li><a href="/posts">Posts</a></li><li><a href="/til.html">TIL</a></li><li><a href="/blogrolls.html">Blogrolls</a></li><li><a href="/feed.xml">RSS</a></li></ul></nav></div></header><article class="container"><div class="blog-content">
<div id="outline-container-orgbffdd74" class="outline-2">
<h2 id="orgbffdd74">Hellooo, Tinkerers!</h2>
<div class="outline-text-2" id="text-orgbffdd74">
<p>
This is Thanga Ayyanar A @ Gold Ayan
</p>

<p>
I am a versatile polyglot programmer with extensive experience across
multiple programming languages. Sometimes, I will deliver a talk at
<b>Kanchilug</b> or participating in a conference in and around
Chennai, where I share my insights and knowledge with fellow tech
enthusiasts. In addition to my speaking engagements, I am passionate
about promoting open-source software and actively translate
open-source books into Tamil, making valuable resources accessible to
a wider audience.
</p>

<p>
My favorite tools include <b><b>Linux</b></b>, <b><b>Emacs</b></b>, and <b><b>Scheme/Lisp</b></b>. I
am also an active member of the Tamil Linux Community, where I
contribute to discussions and share knowledge. You can often find me
engaging with the community at <a href="https://forums.tamillinuxcommunity.org">Tamil Linux Community</a>
</p>

<p>
Additionally, I encourage you to explore the <b>Tamil tech event
Website</b>, which lists various upcoming events in the region. You can
view the website <a href="https://tamilnadu.tech">here</a>. This resource is a great way to stay informed
about the latest happenings in the Tamil tech community.
</p>

<p>
Sometimes i write blog in Tamil language at <a href="https://kaniyam.com">kaniyam.com</a>
</p>
</div>
</div>

<div id="outline-container-org96a937c" class="outline-2">
<h2 id="org96a937c">Social handles</h2>
<div class="outline-text-2" id="text-org96a937c">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">LinkedIn</td>
<td class="org-left"><a href="https://linkedin.com/in/thangaayyanar">https://linkedin.com/in/thangaayyanar</a></td>
</tr>

<tr>
<td class="org-left">Mastodon</td>
<td class="org-left">@goldayan@clj.social</td>
</tr>

<tr>
<td class="org-left">Github</td>
<td class="org-left"><a href="https://github.com/thangaayyanar">https://github.com/thangaayyanar</a></td>
</tr>

<tr>
<td class="org-left">Codeberg</td>
<td class="org-left"><a href="https://codeberg.org/thangaayyanar">https://codeberg.org/thangaayyanar</a></td>
</tr>

<tr>
<td class="org-left">Youtube</td>
<td class="org-left"><a href="https://youtube.com/@goldayantinkers">https://youtube.com/@goldayantinkers</a></td>
</tr>

<tr>
<td class="org-left">IRC</td>
<td class="org-left">Goldayan(nickname) in #kaniyam, #systemcrafters, #ilugc to name a few&#x2026;</td>
</tr>

<tr>
<td class="org-left">Twitter/X.com</td>
<td class="org-left">@0xgoldayan (Not much now a days)</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org96e22f1" class="outline-2">
<h2 id="org96e22f1">About this blog</h2>
<div class="outline-text-2" id="text-org96e22f1">
<ul class="org-ul">
<li>TIL means Today I Learned, this section is inspired from Juila Evans blog.</li>
<li>Project tab contains projects which are currently working on or completed projects.</li>
<li>Posts tab has the blog articles.</li>
<li>Blogrolls my favorite bloggers, podcasts, youtube channels sites (has both tamil and english language blog).</li>
<li>RSS - Rich Site Summary (use feed reader to subscribe this blog).</li>
</ul>

<p>
Feel free to explore the website <a href="https://github.com/goldayan/goldayan.github.io">here</a>, I like to keep the website simple and stupid.
</p>
</div>
</div>
</div></article><footer>This site is made with ❤️ using Emacs.</footer></body></html>
